Revit 2026 API

# CorrectionFactorFactor Property

---

Get factor value of wire correction factor.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Factor { get; }
```
```vb
Public ReadOnly Property Factor As Double
	Get
```
```cpp
public:
property double Factor {
	double get ();
}
```
```fsharp
member Factor : float with get
```

#### Property Value

Double

#### Reference

CorrectionFactor Class

Autodesk.Revit.DB.Electrical Namespace